## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [1]:
import sqlite3

database_connection  = sqlite3.connect("testi.db")

#### Tehtävä 2. Luo yhteys tietokantaan

In [2]:
c = database_connection.cursor()

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [3]:
c.execute("""CREATE TABLE if not exists henkilotaulu (Nimi, Ika, Kengankoko)""")

data_rows = [("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37)]

for data_row in data_rows:
    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))

database_connection.commit()

data = c.execute('''SELECT * FROM henkilotaulu''')
retrieved_data = data.fetchall()

retrieved_data

[('Teppo', 88, 47), ('Matti', 34, 39), ('Ilona', 41, 36), ('Sonja', 32, 37)]

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [4]:
import pandas as pd

sql_query = '''SELECT * FROM henkilotaulu'''

dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)

dataframe_from_sqlite['Hatunkoko']=[7.5, 7, 6.5, 6.875]

dataframe_from_sqlite

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47      7.500
1  Matti   34          39      7.000
2  Ilona   41          36      6.500
3  Sonja   32          37      6.875

#### Tehtävä 5. Tee DataFrame-objektista kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla. Tallenna tämä muokattu dataframe-objekti nyt tietokantaan nimellä `henkilotaulukopio` (tulee edellisen taulun rinnalle).

In [5]:
henkilotaulukopio = dataframe_from_sqlite.copy()
henkilotaulukopio.loc[len(henkilotaulukopio.index)] = ['Hessu', 90, 52, 2.5]

#henkilotaulukopio = henkilotaulukopio.append(pd.DataFrame({"Nimi":"Hessu", "Ika":90, "Kengankoko":52, "Hatunkoko":2.5}))

henkilotaulukopio.to_sql(name="henkilotaulukopio", con=database_connection, if_exists='fail', index=False)

sql_query = '''SELECT * FROM henkilotaulukopio'''
dataframe_from_sqlite_2 = pd.read_sql(sql_query, database_connection)

dataframe_from_sqlite_2

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47      7.500
1  Matti   34          39      7.000
2  Ilona   41          36      6.500
3  Sonja   32          37      6.875
4  Hessu   90          52      2.500

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [6]:
database_connection.commit()
database_connection.close()